{
 "Biden": "Joseph Robinette Biden Jr. (born November 20, 1942) is an American politician who served as the 47th vice president of the United States from 2009 to 2017. Biden also represented Delaware in the U.S. Senate from 1973 to 2009. A member of the Democratic Party, Biden is a candidate for president in the 2020 election. Biden was born in Scranton, Pennsylvania, and lived there for ten years before moving with his family to Delaware. He became a lawyer in 1969 and was elected to the New Castle County Council in 1970. He was first elected to the U.S. Senate in 1972, when he became the sixth-youngest senator in American history. Biden was re-elected six times and was the fourth most senior senator when he resigned to assume the vice presidency in 2009. Biden was a long-time member and former chairman of the Foreign Relations Committee. He opposed the Gulf War in 1991, but advocated U.S. and NATO intervention in the Bosnian War in 1994 and 1995. He voted in favor of the resolution authorizing the Iraq War in 2002 but opposed the surge of U.S. troops in 2007. He has also served as chairman of the Senate Judiciary Committee, dealing with issues related to drug policy, crime prevention, and civil liberties. Biden led the efforts to pass the Violent Crime Control and Law Enforcement Act, and the Violence Against Women Act. He also chaired the Judiciary Committee during the contentious U.S. Supreme Court nominations of Robert Bork and Clarence Thomas. Biden unsuccessfully sought the Democratic presidential nomination in 1988 and in 2008. In 2008, Biden was the running mate of Democratic presidential nominee Barack Obama. As vice president, Biden oversaw infrastructure spending aimed at counteracting the Great Recession and helped formulate U.S. policy toward Iraq through the withdrawal of U.S. troops in 2011. His ability to negotiate with congressional Republicans helped the Obama administration pass legislation such as the Tax Relief, Unemployment Insurance Reauthorization, and Job Creation Act of 2010, which resolved a taxation deadlock;",
 "Yang":"Andrew Yang (born January 13, 1975) is an American 2020 Democratic presidential candidate, entrepreneur, attorney, and philanthropist. He is the founder of Venture for America (VFA), a nonprofit that focuses on creating jobs in struggling American cities. Yang worked in various startups and early stage growth companies as a founder or executive from 2000 to 2009. After founding VFA in 2011, Yang was selected by the Obama administration in 2012 as a Champion of Change and in 2015 as a Presidential Ambassador for Global Entrepreneurship. He is the author of the 2014 book Smart People Should Build Things and the 2018 book The War on Normal People. On November 6, 2017, Yang launched his campaign for the Democratic nomination in the 2020 United States presidential election. Initially considered a long-shot candidate, he gained significant momentum in early 2019 following appearances on several popular shows and podcasts. His signature policy is what he calls the Freedom Dividend, a form of universal basic income (UBI) of $1,000 a month for every American adult over age 18. Yang believes UBI is a necessary response to the rapid development of automation, which is increasingly leading to workforce challenges. He believes that job displacement by automation is what led to the election of Donald Trump in 2016. The other two central elements of his platform are Medicare for All and human-centered capitalism. Over 100 policy proposals have been listed on his campaign website.",
 "Booker": "Cory Anthony Booker (born April 27, 1969) is an American politician serving as the junior United States Senator from New Jersey since 2013 and a member of the Democratic Party. The first African-American U.S. Senator from New Jersey, he was previously the 36th Mayor of Newark from 2006 to 2013. Before that, Booker served on the Municipal Council of Newark for the Central Ward from 1998 to 2002. On February 1, 2019, he announced his campaign to run for the Democratic nomination for President of the United States in the 2020 United States presidential election. Booker was born in Washington, D.C., and raised in Harrington Park, New Jersey. He attended Stanford University, where he received a BA in 1991 and then a master's degree a year later. He studied abroad at the University of Oxford on a Rhodes Scholarship, before attending Yale Law School. He won an upset victory for a seat on the Municipal Council of Newark in 1998, where he staged a 10-day hunger strike and briefly lived in a tent to draw attention to urban development issues in the city. He ran for mayor in 2002, but lost to incumbent Sharpe James; he ran again in 2006 and won against deputy mayor Ronald Rice. His first term saw to the doubling of affordable housing under development and the reduction of the city budget deficit from $180 million to $73 million. He was re-elected in 2010. He ran against Steve Lonegan in the 2013 U.S. Senate special election and subsequently won reelection in 2014 against Jeff Bell. As senator, his voting record was measured as the third most liberal.",
 "Harris": "Kamala Devi Harris (October 20, 1964) is an American lawyer and politician serving as the junior United States Senator from California since 2017. br A member of the Democratic Party, she previously served as the 27th District Attorney of San Francisco from 2004 to 2011 and 32nd Attorney General of California from 2011 until 2017. She is a candidate for the Democratic nomination for President of the United States in the 2020 election. Harris was born in Oakland, California and is a graduate of Howard University and University of California, Hastings College of the Law. In the 1990s, she worked in the San Francisco District Attorney's Office and the City Attorney of San Francisco's office. In 2004, she was elected District Attorney of San Francisco. Harris won the election as California's Attorney General in 2010 and was reelected in 2014 by a wide margin. On November 8, 2016, she defeated Loretta Sanchez in the 2016 Senate election to succeed outgoing Senator Barbara Boxer, becoming California's third female U.S. Senator, and the first of Jamaican or Indian ancestry. Since becoming a Senator, she has supported single-payer healthcare, federal descheduling of cannabis, support for sanctuary cities, the DREAM Act, and lowering the tax burden for the working and middle classes while raising taxes on corporations and the wealthiest one percent of Americans.",
 "Buttigieg": "Peter Paul Montgomery Buttigieg (born January 19, 1982) is an American politician and former U.S. Naval Reserve officer who has served as mayor of South Bend, Indiana, since 2012. He is one of three combat veterans running for the Democratic Party nomination in the 2020 United States presidential election.After graduating from Harvard University, and then from Pembroke College, Oxford, on a Rhodes Scholarship, Buttigieg worked as a consultant at McKinsey and Company. From 2009 to 2017 he served as an intelligence officer in the United States Navy Reserve, attaining the rank of lieutenant and deploying to Afghanistan in 2014. Buttigieg was elected mayor of South Bend in 2011 and reelected in 2015. Before his reelection, he came out publicly as gay. On April 14, 2019, Buttigieg announced his campaign for the Democratic nomination for President of the United States in 2020, after having formed an exploratory committee in January 2019. His platform includes support for reducing income inequality, pro-environmental policies, cooperation between the Democratic Party and organized labor, universal background checks for firearms purchases, the Equality Act, and preserving the DACA program for children of illegal immigrants. Buttigieg also supports reforms that would end gerrymandering, overturn the Citizens United v. FEC decision, and abolish the Electoral College.",
 "Trump": "Donald John Trump (born June 14, 1946) is the 45th and current president of the United States. Before entering politics, he was a businessman and television personality. Trump was born and raised in the New York City borough of Queens, and received an economics degree from the Wharton School. He took charge of his family's real estate business in 1971, renamed it The Trump Organization, and expanded it from Queens and Brooklyn into Manhattan. The company built or renovated skyscrapers, hotels, casinos, and golf courses. Trump later started various side ventures, mostly by licensing his name. He managed the company until his 2017 inauguration. He co-authored several books, including The Art of the Deal. He owned the Miss Universe and Miss USA beauty pageants from 1996 to 2015, and produced and hosted The Apprentice, a reality television show, from 2003 to 2015. Forbes estimates his net worth to be $3.1 billion. Trump entered the 2016 presidential race as a Republican and defeated 16 other candidates in the primaries. Commentators described his political positions as populist, protectionist, and nationalist. He was elected in a surprise victory over Democratic nominee Hillary Clinton, although he lost the popular vote.[b] He became the oldest first-term U.S. president,[c] and the first one without prior military or government service. His election and policies have sparked numerous protests. Trump has made many false or misleading statements during his campaign and presidency. The statements have been documented by fact-checkers, and the media have widely described the phenomenon as unprecedented in American politics. Many of his comments and actions have also been characterized as racially charged or racist.",
 "Warren": " Elizabeth Ann Warren (June 22, 1949) is an American politician and former academic serving as the senior United States Senator from Massachusetts since 2013. Warren was formerly a law school professor specializing in bankruptcy law. A progressive, she has focused on consumer protection, economic opportunity, and the social safety net while in the Senate. Warren is a graduate of the University of Houston and Rutgers Law School and has taught law at several universities, including the University of Houston, the University of Texas at Austin, the University of Pennsylvania, and Harvard University. She was one of the most cited professors in the field of commercial law before beginning her political career. She is the author of three and coauthor of six books, both academic and for a general audience. Warren's initial foray into public policy began in 1995 when she worked to oppose what eventually became a 2005 act restricting bankruptcy access for individuals. Her national profile rose during the late 2000s following her forceful public stances in favor of more stringent banking regulations following the 2007–08 financial crisis. She served as chair of the Congressional Oversight Panel of the Troubled Asset Relief Program and was instrumental in the creation of the Consumer Financial Protection Bureau, of which she served as the first Special Advisor under President Obama. ",
 "Beto": "Robert Francis O'Rourke (born September 26, 1972) is an American politician who represented Texas's 16th congressional district in the United States House of Representatives from 2013 to 2019. O'Rourke is seeking the Democratic nomination for President of the United States in 2020. O'Rourke was born into a local political family in El Paso, Texas, and is a graduate of Woodberry Forest School and Columbia University.[1] While studying at Columbia, O'Rourke began a brief music career as bass guitarist in the post-hardcore band Foss. After his college graduation, he returned to El Paso and began a business career. In 2005, he was elected to the El Paso City Council, serving until 2011. O'Rourke was elected to the U.S. House of Representatives in 2012 after defeating eight-term incumbent Democrat Silvestre Reyes in the primary. After being re-elected to the House in 2014 and 2016, O'Rourke declined to seek re-election in 2018. Instead, he ran for United States Senate against incumbent Republican Ted Cruz, running a competitive campaign that drew national attention. Despite his narrow defeat, O'Rourke set a record for most votes ever cast for a Democrat in Texas history. On March 14, 2019, O'Rourke announced his campaign for President of the United States in the 2020 United States presidential election.",
 "Klobuchar": "Amy Jean Klobuchar (born May 25, 1960) is an American lawyer and politician serving as the senior United States Senator from Minnesota. A member of the Minnesota Democratic-Farmer-Labor Party, Minnesota's affiliate of the Democratic Party, she previously served as the Hennepin County Attorney. Born in Plymouth, Minnesota, Klobuchar is a graduate of Yale University and the University of Chicago Law School. She was a partner at two Minneapolis law firms before being elected county attorney for Hennepin County in 1998, making her responsible for all criminal prosecution in Minnesota's most populous county. Klobuchar was first elected to the Senate in 2006, becoming Minnesota's first elected female United States Senator, and reelected in 2012 and 2018.[1] In 2009 and 2010 she was described as a rising star in the Democratic Party.[2][3] She is running for the Democratic nomination for President of the United States in the 2020 election.",
 "Castro": "Julián Castro (born September 16, 1974) is an American Democratic politician who was the youngest member of President Obama's Cabinet, serving as the 16th United States Secretary of Housing and Urban Development from 2014 to 2017. In 2001, Castro was elected to the San Antonio City Council, winning 61 percent of the vote against five challengers. At age 26 he was the youngest city councilman in San Antonio history, surpassing Henry Cisneros. Castro served as the mayor of his native San Antonio, Texas from 2009 until he joined Obama's cabinet in 2014. He was mentioned as a possible running mate for Hillary Clinton during the 2016 presidential campaign. Castro is the twin brother of Congressman Joaquin Castro. On January 12, 2019, Castro launched his campaign for the Democratic nomination for President of the United States in 2020 in San Antonio.",
 "Gillibrand": "Kirsten Elizabeth Gillibrand (born December 9, 1966) is an American lawyer and politician who has served as the junior United States Senator from New York since 2009. A member of the Democratic Party, she was a member of the U.S. House of Representatives from 2007 to 2009. Born and raised in upstate New York, Gillibrand graduated from Dartmouth College and from the UCLA School of Law. After holding positions in government and private practice and working on Hillary Clinton's 2000 U.S. Senate campaign, Gillibrand was elected to the United States House of Representatives in 2006. She represented New York's 20th congressional district, a conservative district in upstate New York, and was re-elected in 2008. During her House tenure, Gillibrand was a Blue Dog Democrat noted for voting against the Emergency Economic Stabilization Act of 2008 (commonly known as the bank bailout) and for supporting Medicare-for-all. Following Senator Clinton's appointment as Secretary of State in 2009, Governor David Paterson selected Gillibrand to fill the Senate seat that had been vacated by Clinton. Gillibrand won a special election in 2010 to keep the seat, and was re-elected to full terms in 2012 and 2018. During her Senate tenure, Gillibrand has shifted to the left. She has been outspoken on sexual assault in the military and sexual harassment, having criticized President Bill Clinton and Senator Al Franken, both fellow Democrats, for sexual misconduct. She supports paid family leave, a federal jobs guarantee, and the abolition and replacement of the U.S. Immigration and Customs Enforcement.",
 "Weld": "William Floyd Weld (born July 31, 1945) is an American attorney, businessman, and Republican politician who served as the 68th Governor of Massachusetts from 1991 to 1997. Weld is running for the Republican nomination for President of the United States in 2020. A Harvard and Oxford graduate, Weld began his career as legal counsel to the United States House Committee on the Judiciary before becoming the United States Attorney for the District of Massachusetts and, later, the United States Assistant Attorney General for the Criminal Division. He worked on a series of high-profile public corruption cases and later resigned in protest of an ethics scandal and associated investigations into Attorney General Edwin Meese. Weld became involved in presidential politics in later years. In 2016, he left the Republican Party to become the Libertarian Party running mate of former Governor of New Mexico Gary Johnson. Johnson and Weld were the first presidential ticket since 1948 to consist of two state governors. They received nearly 4.5 million popular votes, the best-ever showing for a Libertarian ticket and the best showing for any third-party ticket since 1996. After returning to the Republican Party, Weld announced on April 15, 2019 that he would challenge President Donald Trump in the 2020 Republican primaries.",
 "Ryan": "Timothy John Ryan (born July 16, 1973) is an American politician serving as the U.S. Representative for Ohio's 13th congressional district since 2003. The district, numbered as the 17th district from 2003 to 2013, takes in a large swath of northeast Ohio, from Youngstown to Akron. Ryan is a member of the Democratic Party. Born in Niles, Ohio, Ryan worked as an aide to Congressman Jim Traficant after graduating from Bowling Green State University. He served in the Ohio Senate from 2001 to 2002 before winning an election to succeed Traficant. In November 2016, Ryan launched an unsuccessful challenge to unseat Nancy Pelosi as party leader of the House Democrats. Following the 2018 midterms, Ryan was widely seen as a possible presidential hopeful for the 2020 presidential election. In February and March 2019, he traveled to early primary states such as Iowa and New Hampshire. Ryan's 2020 presidential campaign officially began on April 4, 2019, when he announced that he would be running in the Democratic primaries. Ryan announced that he would seek the Democratic nomination for president during an interview on The View. ",
 "Sanders": " Bernard Sanders (born September 8, 1941) is an American politician who has served as the junior United States Senator from Vermont since 2007. Vermont's at-large Congressman from 1991 to 2007, he is the longest serving independent in U.S. congressional history and a member of the Democratic caucus. Sanders ran unsuccessfully for the 2016 Democratic nomination for president and is running again in 2020. A self-described democratic socialist and progressive, Sanders is known for his opposition to economic inequality. On domestic policy, he broadly supports labor rights, and has supported universal and single-payer healthcare, paid parental leave, and tuition-free tertiary education. On foreign policy, he broadly supports reducing military spending, pursuing more diplomacy and international cooperation, and putting greater emphasis on labor rights and environmental concerns when negotiating international trade agreements. Sanders was born and raised in the Brooklyn borough of New York City, and attended Brooklyn College before graduating from the University of Chicago in 1964. While a student he was an active protest organizer for the Congress of Racial Equality and the Student Nonviolent Coordinating Committee during the civil rights movement. After settling in Vermont in 1968, Sanders ran unsuccessful third-party political campaigns in the early to mid-1970s. As an independent, he was elected mayor of Burlington in 1981 by a margin of ten votes. He was reelected three times. He won election to the U.S. House of Representatives in 1990, representing Vermont's at-large congressional district; he later co-founded the Congressional Progressive Caucus. Sanders served as a U.S. Representative for 16 years before being elected to the U.S. Senate in 2006. He was reelected to the Senate in 2012 and 2018. In April 2015 Sanders announced his campaign for the 2016 Democratic nomination for president of the United States. Despite initially low expectations, he went on to win 23 primaries and caucuses and approximately 43% of pledged delegates, to Hillary Clinton's 55%.",
 "Bullock": "Stephen Clark Bullock (born April 11, 1966) is an American politician, attorney and former professor serving as the 24th and current Governor of Montana since 2013. He is a member of the Democratic Party. Born in Missoula, Montana, Bullock graduated from Claremont McKenna College and Columbia Law School. He began his career working as legal counsel to the Secretary of State of Montana before becoming the Executive Assistant Attorney General and acting Chief Deputy Attorney General of Montana. Bullock then entered private practice as an attorney for Steptoe & Johnson. He was an adjunct professor at the George Washington University Law School before opening his own law firm upon returning to Montana. In 2008, Bullock was elected Attorney General of Montana, and he served one term from 2009 to 2013. Bullock declared his candidacy for Governor of Montana on September 7, 2011. The seat was open in 2012, as incumbent Governor Brian Schweitzer, a Democrat, could not seek reelection due to term limits. Bullock won the Democratic primary with 87% of the vote and defeated Republican nominee Rick Hill in the general election with 48% of the vote. In 2016, Bullock won re-election with 50.2% of the vote, defeating Republican nominee Greg Gianforte. Bullock chaired the National Governors Association from 2018 to 2019. He is a Democratic candidate for President of the United States in 2020."


 

}

